var React = require('react');
var ReactCreateClass = require('create-react-class');

var Home = ReactCreateClass({
    render: function () {
        return (
            <div className="row">
                <h1>StickyPad Home</h1>
                <p>这一首诗，是昔年大唐国时，一个修真炼性的英雄，入圣超凡的豪杰，到后来
                位居紫府，名列仙班，率领上八洞群仙，救拔四部洲沉苦一位仙长，姓吕名岩，道
                号纯阳子祖师所作。单道世上人，营营逐逐，急急巴巴，跳不出七情六欲关头，打
                不破酒色财气圈子。到头来同归于尽，着甚要紧！虽是如此说，只这酒色财气四件
                中，惟有“财色”二者更为利害。怎见得他的利害？假如一个人到了那穷苦的田地
                ，受尽无限凄凉，耐尽无端懊恼，晚来摸一摸米瓮，苦无隔宿之炊，早起看一看厨
                前，愧无半星烟火，妻子饥寒，一身冻馁，就是那粥饭尚且艰难，那讨馀钱沽酒！
                更有一种可恨处，亲朋白眼，面目寒酸，便是凌云志气，分外消磨，怎能够与人争
                    气！正是：</p>
                <p>
                一朝马死黄金尽，亲者如同陌路人。
                </p>
                <p>
                到得那有钱时节，挥金买笑，一掷巨万。思饮酒真个琼浆玉液，不数那琥珀杯流；
                要斗气钱可通神，果然是颐指气使。趋炎的压脊挨肩，附势的吮痈舐痔，真所谓得
                势叠肩而来，失势掉臂而去。古今炎冷恶态，莫有甚于此者。这两等人，岂不是受
                那财的利害处！如今再说那色的利害。请看如今世界，你说那坐怀不乱的柳下惠，
                闭门不纳的鲁男子，与那秉烛达旦的关云长，古今能有几人？至如三妻四妾，买笑
                追欢的，又当别论。还有那一种好色的人，见了个妇女略有几分颜色，便百计千方
                偷寒送暖，一到了着手时节，只图那一瞬欢娱，也全不顾亲戚的名分，也不想朋友
                的交情。起初时不知用了多少滥钱，费了几遭酒食。正是：
                </p>
                <p>三杯花作合，两盏色媒人。</p>

            </div>
        )
    }
});
module.exports=Home;